tap "kazuakiyama/pgplot"
tap "supabase/tap"
brew "btop"
brew "glib"
brew "python@3.12"
brew "cairo"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "duf"
brew "gcc"
brew "gh"
brew "git-filter-repo"
brew "glances"
brew "gsl"
brew "htop"
brew "imagemagick"
brew "localtunnel"
brew "lsd"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "open-mpi"
brew "parallel"
brew "pigz"
brew "pkgconf"
brew "powerlevel10k"
brew "pv"
brew "rsyncy"
brew "supabase"
brew "task-spooler"
brew "tmux"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "kazuakiyama/pgplot/pgplot"
cask "1password-cli"
cask "xquartz"
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "janisdd.vscode-edit-csv"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "quarto.quarto"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
